tutorials/uniformFlow_2Turbines_AL/constant/airfoils/airfoil_24
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_24
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180.00   0.0267    0.000)
        (-175.00   0.0370    0.274)
        (-170.00   0.0968    0.547)
        (-160.00   0.2876    0.685)
        (-155.00   0.4025    0.766)
        (-150.00   0.5232    0.816)
        (-145.00   0.6454    0.836)
        (-140.00   0.7656    0.832)
        (-135.00   0.8807    0.804)
        (-130.00   0.9882    0.756)
        (-125.00   1.0861    0.690)
        (-120.00   1.1730    0.609)
        (-115.00   1.2474    0.515)
        (-110.00   1.3084    0.411)
        (-105.00   1.3552    0.300)
        (-100.00   1.3875    0.182)
        ( -95.00   1.4048    0.061)
        ( -90.00   1.4070   -0.061)
        ( -85.00   1.3941   -0.183)
        ( -80.00   1.3664   -0.302)
        ( -75.00   1.3240   -0.416)
        ( -70.00   1.2676   -0.523)
        ( -65.00   1.1978   -0.622)
        ( -60.00   1.1156   -0.708)
        ( -55.00   1.0220   -0.781)
        ( -50.00   0.9187   -0.838)
        ( -45.00   0.8074   -0.877)
        ( -40.00   0.6904   -0.895)
        ( -35.00   0.5703   -0.889)
        ( -30.00   0.4503   -0.858)
        ( -25.00   0.3357   -0.832)
        ( -24.00   0.3147   -0.852)
        ( -23.00   0.2946   -0.882)
        ( -22.00   0.2752   -0.919)
        ( -21.00   0.2566   -0.963)
        ( -20.00   0.2388   -1.013)
        ( -19.00   0.2218   -1.067)
        ( -18.00   0.2056   -1.125)
        ( -17.00   0.1901   -1.185)
        ( -16.00   0.1754   -1.245)
        ( -15.25   0.1649   -1.290)
        ( -14.24   0.1461   -1.229)
        ( -13.24   0.1263   -1.148)
        ( -12.22   0.1051   -1.052)
        ( -11.22   0.0886   -0.965)
        ( -10.19   0.0740   -0.867)
        (  -9.70   0.0684   -0.822)
        (  -9.18   0.0605   -0.769)
        (  -8.18   0.0270   -0.756)
        (  -7.19   0.0180   -0.690)
        (  -6.65   0.0166   -0.616)
        (  -6.13   0.0152   -0.542)
        (  -6.00   0.0117   -0.525)
        (  -5.50   0.0105   -0.451)
        (  -5.00   0.0097   -0.382)
        (  -4.50   0.0092   -0.314)
        (  -4.00   0.0091   -0.251)
        (  -3.50   0.0089   -0.189)
        (  -3.00   0.0089   -0.120)
        (  -2.50   0.0088   -0.051)
        (  -2.00   0.0088    0.017)
        (  -1.50   0.0088    0.085)
        (  -1.00   0.0088    0.152)
        (  -0.50   0.0088    0.219)
        (   0.00   0.0087    0.288)
        (   0.50   0.0087    0.354)
        (   1.00   0.0088    0.421)
        (   1.50   0.0089    0.487)
        (   2.00   0.0090    0.554)
        (   2.50   0.0091    0.619)
        (   3.00   0.0092    0.685)
        (   3.50   0.0093    0.749)
        (   4.00   0.0095    0.815)
        (   4.50   0.0096    0.879)
        (   5.00   0.0097    0.944)
        (   5.50   0.0099    1.008)
        (   6.00   0.0101    1.072)
        (   6.50   0.0103    1.135)
        (   7.00   0.0107    1.197)
        (   7.50   0.0112    1.256)
        (   8.00   0.0125    1.305)
        (   9.00   0.0155    1.390)
        (   9.50   0.0171    1.424)
        (  10.00   0.0192    1.458)
        (  10.50   0.0219    1.488)
        (  11.00   0.0255    1.512)
        (  11.50   0.0307    1.533)
        (  12.00   0.0370    1.549)
        (  12.50   0.0452    1.558)
        (  13.00   0.0630    1.470)
        (  13.50   0.0784    1.398)
        (  14.00   0.0931    1.354)
        (  14.50   0.1081    1.336)
        (  15.00   0.1239    1.333)
        (  15.50   0.1415    1.326)
        (  16.00   0.1592    1.329)
        (  16.50   0.1743    1.326)
        (  17.00   0.1903    1.321)
        (  17.50   0.2044    1.331)
        (  18.00   0.2186    1.333)
        (  18.50   0.2324    1.340)
        (  19.00   0.2455    1.362)
        (  19.50   0.2584    1.382)
        (  20.00   0.2689    1.398)
        (  20.50   0.2814    1.426)
        (  21.00   0.2943    1.437)
        (  22.00   0.3246    1.418)
        (  23.00   0.3557    1.397)
        (  24.00   0.3875    1.376)
        (  25.00   0.4198    1.354)
        (  26.00   0.4524    1.332)
        (  28.00   0.5183    1.293)
        (  30.00   0.5843    1.265)
        (  32.00   0.6492    1.253)
        (  35.00   0.7438    1.264)
        (  40.00   0.8970    1.258)
        (  45.00   1.0402    1.217)
        (  50.00   1.1686    1.146)
        (  55.00   1.2779    1.049)
        (  60.00   1.3647    0.932)
        (  65.00   1.4267    0.799)
        (  70.00   1.4621    0.657)
        (  75.00   1.4708    0.509)
        (  80.00   1.4544    0.362)
        (  85.00   1.4196    0.221)
        (  90.00   1.3938    0.092)
        (  95.00   1.3943   -0.030)
        ( 100.00   1.3798   -0.150)
        ( 105.00   1.3504   -0.267)
        ( 110.00   1.3063   -0.379)
        ( 115.00   1.2481   -0.483)
        ( 120.00   1.1763   -0.578)
        ( 125.00   1.0919   -0.660)
        ( 130.00   0.9962   -0.727)
        ( 135.00   0.8906   -0.777)
        ( 140.00   0.7771   -0.807)
        ( 145.00   0.6581   -0.815)
        ( 150.00   0.5364   -0.797)
        ( 155.00   0.4157   -0.750)
        ( 160.00   0.3000   -0.673)
        ( 170.00   0.1051   -0.547)
        ( 175.00   0.0388   -0.274)
        ( 180.00   0.0267    0.000)
    );
}
