tutorials/uniformFlow_2Turbines_AL/constant/airfoils/airfoil_32
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_32
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
         (-180.00   0.0202    0.000)
         (-175.00   0.0324    0.368)
         (-170.00   0.0943    0.735)
         (-160.00   0.2848    0.695)
         (-155.00   0.4001    0.777)
         (-150.00   0.5215    0.828)
         (-145.00   0.6447    0.850)
         (-140.00   0.7660    0.846)
         (-135.00   0.8823    0.818)
         (-130.00   0.9911    0.771)
         (-125.00   1.0905    0.705)
         (-120.00   1.1787    0.624)
         (-115.00   1.2545    0.530)
         (-110.00   1.3168    0.426)
         (-105.00   1.3650    0.314)
         (-100.00   1.3984    0.195)
         ( -95.00   1.4169    0.073)
         ( -90.00   1.4201   -0.050)
         ( -85.00   1.4081   -0.173)
         ( -80.00   1.3811   -0.294)
         ( -75.00   1.3394   -0.409)
         ( -70.00   1.2833   -0.518)
         ( -65.00   1.2138   -0.617)
         ( -60.00   1.1315   -0.706)
         ( -55.00   1.0378   -0.780)
         ( -50.00   0.9341   -0.839)
         ( -45.00   0.8221   -0.879)
         ( -40.00   0.7042   -0.898)
         ( -35.00   0.5829   -0.893)
         ( -30.00   0.4616   -0.862)
         ( -25.00   0.3441   -0.803)
         ( -24.00   0.3209   -0.792)
         ( -23.00   0.2972   -0.789)
         ( -22.00   0.2730   -0.792)
         ( -21.00   0.2485   -0.801)
         ( -20.00   0.2237   -0.815)
         ( -19.00   0.1990   -0.833)
         ( -18.00   0.1743   -0.854)
         ( -17.00   0.1498   -0.879)
         ( -16.00   0.1256   -0.905)
         ( -15.00   0.1020   -0.932)
         ( -14.00   0.0789   -0.959)
         ( -13.00   0.0567   -0.985)
         ( -13.00   0.0567   -0.985)
         ( -12.01   0.0271   -0.953)
         ( -11.00   0.0303   -0.900)
         (  -9.98   0.0287   -0.827)
         (  -8.98   0.0271   -0.753)
         (  -8.47   0.0264   -0.691)
         (  -7.45   0.0114   -0.555)
         (  -6.42   0.0094   -0.413)
         (  -5.40   0.0086   -0.271)
         (  -5.00   0.0073   -0.220)
         (  -4.50   0.0071   -0.152)
         (  -4.00   0.0070   -0.084)
         (  -3.50   0.0069   -0.018)
         (  -3.00   0.0068    0.049)
         (  -2.50   0.0068    0.115)
         (  -2.00   0.0068    0.181)
         (  -1.50   0.0067    0.247)
         (  -1.00   0.0067    0.312)
         (  -0.50   0.0067    0.377)
         (   0.00   0.0065    0.444)
         (   0.50   0.0065    0.508)
         (   1.00   0.0066    0.573)
         (   1.50   0.0067    0.636)
         (   2.00   0.0068    0.701)
         (   2.50   0.0069    0.765)
         (   3.00   0.0070    0.827)
         (   3.50   0.0071    0.890)
         (   4.00   0.0073    0.952)
         (   4.50   0.0076    1.013)
         (   5.00   0.0079    1.062)
         (   6.00   0.0099    1.161)
         (   6.50   0.0117    1.208)
         (   7.00   0.0132    1.254)
         (   7.50   0.0143    1.301)
         (   8.00   0.0153    1.336)
         (   8.50   0.0165    1.369)
         (   9.00   0.0181    1.400)
         (   9.50   0.0211    1.428)
         (  10.00   0.0262    1.442)
         (  10.50   0.0336    1.427)
         (  11.00   0.0420    1.374)
         (  11.50   0.0515    1.316)
         (  12.00   0.0601    1.277)
         (  12.50   0.0693    1.250)
         (  13.00   0.0785    1.246)
         (  13.50   0.0888    1.247)
         (  14.00   0.1000    1.256)
         (  14.50   0.1108    1.260)
         (  15.00   0.1219    1.271)
         (  15.50   0.1325    1.281)
         (  16.00   0.1433    1.289)
         (  16.50   0.1541    1.294)
         (  17.00   0.1649    1.304)
         (  17.50   0.1754    1.309)
         (  18.00   0.1845    1.315)
         (  18.50   0.1953    1.320)
         (  19.00   0.2061    1.330)
         (  19.50   0.2170    1.343)
         (  20.00   0.2280    1.354)
         (  20.50   0.2390    1.359)
         (  21.00   0.2536    1.360)
         (  22.00   0.2814    1.325)
         (  23.00   0.3098    1.288)
         (  24.00   0.3386    1.251)
         (  25.00   0.3678    1.215)
         (  26.00   0.3972    1.181)
         (  28.00   0.4563    1.120)
         (  30.00   0.5149    1.076)
         (  32.00   0.5720    1.056)
         (  35.00   0.6548    1.066)
         (  40.00   0.7901    1.064)
         (  45.00   0.9190    1.035)
         (  50.00   1.0378    0.980)
         (  55.00   1.1434    0.904)
         (  60.00   1.2333    0.810)
         (  65.00   1.3055    0.702)
         (  70.00   1.3587    0.582)
         (  75.00   1.3922    0.456)
         (  80.00   1.4063    0.326)
         (  85.00   1.4042    0.197)
         (  90.00   1.3985    0.072)
         (  95.00   1.3973   -0.050)
         ( 100.00   1.3810   -0.170)
         ( 105.00   1.3498   -0.287)
         ( 110.00   1.3041   -0.399)
         ( 115.00   1.2442   -0.502)
         ( 120.00   1.1709   -0.596)
         ( 125.00   1.0852   -0.677)
         ( 130.00   0.9883   -0.743)
         ( 135.00   0.8818   -0.792)
         ( 140.00   0.7676   -0.821)
         ( 145.00   0.6481   -0.826)
         ( 150.00   0.5264   -0.806)
         ( 155.00   0.4060   -0.758)
         ( 160.00   0.2912   -0.679)
         ( 170.00   0.0995   -0.735)
         ( 175.00   0.0356   -0.368)
         ( 180.00   0.0202    0.000)
    );
}
