tutorials/uniformFlow_2Turbines_AL/constant/forcesRadialDistribution.txt
forcesRadialDistribution
(
//(Uref[m/s], Uinf[m/s], r[m], Udi(r)[m/s], fn(r)[(N/m^2)/(kg/m^3)], ft(r)[(N/m^2)/(kg/m^3)])
(4  4 2.25 2.708 7.301 13.447)
(4  4 6.75 2.707 7.301 4.482)
(4  4 11.25 2.703 7.301 2.689)
(4  4 15.75 2.696 7.301 1.921)
(4  4 20.25 2.692 7.301 1.494)
(4  4 24.75 2.682 7.301 1.222)
(4  4 29.25 2.669 7.301 1.034)
(4  4 33.75 2.668 7.301 0.896)
(4  4 38.25 2.669 7.301 0.791)
(4  4 42.75 2.699 7.301 0.708)
(4  4 47.25 2.747 7.301 0.640)
(4  4 51.75 2.844 7.301 0.585)
(4  4 56.25 2.978 7.301 0.538)
(4  4 60.75 3.149 7.301 0.498)
(4  5 2.25 3.423 11.408 26.265)
(4  5 6.75 3.421 11.408 8.755)
(4  5 11.25 3.414 11.408 5.253)
(4  5 15.75 3.403 11.408 3.752)
(4  5 20.25 3.394 11.408 2.918)
(4  5 24.75 3.381 11.408 2.388)
(4  5 29.25 3.363 11.408 2.020)
(4  5 33.75 3.361 11.408 1.751)
(4  5 38.25 3.362 11.408 1.545)
(4  5 42.75 3.400 11.408 1.382)
(4  5 47.25 3.461 11.408 1.251)
(4  5 51.75 3.582 11.408 1.142)
(4  5 56.25 3.747 11.408 1.051)
(4  5 60.75 3.959 11.408 0.973)
(4  6 2.25 4.157 16.428 45.385)
(4  6 6.75 4.153 16.428 15.128)
(4  6 11.25 4.142 16.428 9.077)
(4  6 15.75 4.126 16.428 6.484)
(4  6 20.25 4.112 16.428 5.043)
(4  6 24.75 4.093 16.428 4.126)
(4  6 29.25 4.070 16.428 3.491)
(4  6 33.75 4.067 16.428 3.026)
(4  6 38.25 4.070 16.428 2.670)
(4  6 42.75 4.116 16.428 2.389)
(4  6 47.25 4.190 16.428 2.161)
(4  6 51.75 4.334 16.428 1.973)
(4  6 56.25 4.530 16.428 1.815)
(4  6 60.75 4.780 16.428 1.681)
(4  7 2.25 4.909 22.361 72.070)
(4  7 6.75 4.902 22.361 24.023)
(4  7 11.25 4.887 22.360 14.414)
(4  7 15.75 4.865 22.360 10.296)
(4  7 20.25 4.844 22.361 8.008)
(4  7 24.75 4.819 22.360 6.552)
(4  7 29.25 4.790 22.360 5.544)
(4  7 33.75 4.786 22.361 4.805)
(4  7 38.25 4.791 22.360 4.239)
(4  7 42.75 4.846 22.360 3.793)
(4  7 47.25 4.933 22.360 3.432)
(4  7 51.75 5.101 22.360 3.133)
(4  7 56.25 5.326 22.361 2.883)
(4  7 60.75 5.613 22.360 2.669)
(4  8 2.25 5.678 29.206 107.579)
(4  8 6.75 5.668 29.206 35.860)
(4  8 11.25 5.648 29.206 21.516)
(4  8 15.75 5.618 29.205 15.368)
(4  8 20.25 5.589 29.205 11.953)
(4  8 24.75 5.558 29.206 9.780)
(4  8 29.25 5.523 29.206 8.275)
(4  8 33.75 5.518 29.206 7.172)
(4  8 38.25 5.524 29.206 6.328)
(4  8 42.75 5.588 29.206 5.662)
(4  8 47.25 5.689 29.206 5.123)
(4  8 51.75 5.878 29.206 4.677)
(4  8 56.25 6.132 29.206 4.303)
(4  8 60.75 6.454 29.206 3.984)
(4  9 2.25 6.464 36.963 153.174)
(4  9 6.75 6.451 36.963 51.058)
(4  9 11.25 6.424 36.963 30.635)
(4  9 15.75 6.386 36.963 21.882)
(4  9 20.25 6.348 36.963 17.019)
(4  9 24.75 6.309 36.963 13.925)
(4  9 29.25 6.267 36.963 11.783)
(4  9 33.75 6.260 36.963 10.212)
(4  9 38.25 6.268 36.963 9.010)
(4  9 42.75 6.341 36.963 8.062)
(4  9 47.25 6.453 36.963 7.294)
(4  9 51.75 6.665 36.963 6.660)
(4  9 56.25 6.945 36.963 6.127)
(4  9 60.75 7.302 36.963 5.673)
(4  10 2.25 7.268 45.634 210.116)
(4  10 6.75 7.251 45.634 70.039)
(4  10 11.25 7.216 45.634 42.023)
(4  10 15.75 7.168 45.634 30.017)
(4  10 20.25 7.120 45.634 23.346)
(4  10 24.75 7.071 45.634 19.101)
(4  10 29.25 7.021 45.634 16.163)
(4  10 33.75 7.012 45.634 14.008)
(4  10 38.25 7.021 45.634 12.360)
(4  10 42.75 7.101 45.634 11.059)
(4  10 47.25 7.226 45.634 10.006)
(4  10 51.75 7.458 45.634 9.135)
(4  10 56.25 7.765 45.634 8.405)
(4  10 60.75 8.156 45.634 7.782)
(4  11 2.25 8.090 55.217 279.664)
(4  11 6.75 8.069 55.217 93.221)
...
);
