tutorials/uniformFlow_2Turbines_AL/constant/wtCurvesTable_NREL5MW.txt
/*----------------------------------------------------------------------------*
|   wtActuatorFOAM:                                                           |
|                                                                             |
|    Yet another actuator library to simulate wind turbines in OpenFOAM       |
|                                                                             |
| Copyright (C) 2025 Computational Simulation Center (CSC-CONICET)--Argentina |
|                                                                             |
| This library is based on OpenFOAM: The Open Source CFD Toolbox,             |
| Copyright (C) 2011-2016 OpenFOAM Foundation,                                |
| Copyright (C) 2018-2025 OpenCFD Ltd.                                        |
\*----------------------------------------------------------------------------*
  Characteristic curves of the NREL5MW RWT 
  Calibrated with a 16 cells/D mesh
  Glauert tip factor and Sorensen root factor (root distance = 0.3)
\*---------------------------------------------------------------------------*/

wtCurvesTable
(
    //(Uref[m/s]    Ud[m/s]     Cp  Ct  omega[rad/s]    pitch[deg])
    (4     3.20783  0.500955604    0.688028159     0.444438  0.0)
    (5     4.00978  0.50095916     0.688032905     0.555551  0.0)
    (6     4.81175  0.500957466    0.688031159     0.666658  0.0)
    (7     5.61369  0.500963313    0.68804007      0.777777  0.0)
    (8     6.41570  0.500954168    0.688021612     0.888867  0.0)
    (9     7.21761  0.500964877    0.688040858     1.00000   0.0)
    (10    8.01957  0.50096364     0.688039452     1.11111   0.0)
    (11    8.82058  0.501095949    0.68829123      1.22265   0.0)
    (11.4  9.59543  0.450468213    0.573748806     1.26711   2.46)
    (12    10.493   0.389715085    0.473409687     1.26711   4.18)
    (13    11.8442  0.306607559    0.354977629     1.26710   6.60)
    (14    13.0913  0.24277962     0.273221773     1.26711   8.70)
    (15    14.2535  0.197853867    0.219087557     1.26713   10.45)
    (16    15.3749  0.163228614    0.178910804     1.26710   12.06)
    (17    16.4643  0.136770214    0.148996980     1.26709   13.54)
    (18    17.5314  0.116196447    0.126158363     1.26709   14.92)
    (19    18.584   0.099630164    0.108048914     1.26709   16.23)
    (20    19.6249  0.086388404    0.093734316     1.26711   17.47)
    (21    20.6605  0.075021117    0.081545351     1.26711   18.70)
    (22    21.693   0.064968926    0.070805895     1.26711   19.94)
    (23    22.7229  0.055941878    0.061211021     1.26711   21.18)
    (24    23.7461  0.048828402    0.053635591     1.26711   22.35)
    (25    24.765   0.043062631    0.04748054      1.26711   23.47)
); 
