tutorials/uniformFlow_2Turbines_AL/system/Lambda2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Calculate Lambda2 (from U)
Lambda2
{
   // Mandatory entries
    type            Lambda2;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;

}


// ************************************************************************* //
