tutorials/uniformFlow_2Turbines_AL/system/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Calculate Q (from U)
Q
{
   // Mandatory entries
    type            Q;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    executeControl  writeTime;
    executeInterval 1;
    writeControl    writeTime;

}


// ************************************************************************* //
