tutorials/uniformFlow_2Turbines_AL/system/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Calculate vorticity

vorticity
{
    // Mandatory entries (unmodifiable)
    type        vorticity;
    libs        (fieldFunctionObjects);

    // Optional (inherited) entries
    executeControl  writeTime;
    executeInterval 5;
    writeControl    writeTime;
}


// ************************************************************************* //
